[
  {
    "term": "AAAR",
    "definition": "Appellate Authority for Advance Ruling - Reviews advance rulings issued by GAAR under GST Act Sections 98-101",
    "technicalNote": "Hears appeals against GAAR orders under Section 108 of GST Act. Established at state level to resolve disputes on advance rulings.",
    "relatedTerms": ["GAAR", "Advance Ruling", "Revisional Authority"],
    "category": "legal"
  },
  {
    "term": "GAAR",
    "definition": "GST Authority for Advance Ruling - Issues advance rulings on GST matters to provide clarity before transactions",
    "technicalNote": "Constituted under Section 96 of GST Act. Provides rulings on classification, applicability of notifications, and tax liability.",
    "relatedTerms": ["AAAR", "Advance Ruling", "GST"],
    "category": "legal"
  },
  {
    "term": "GSTAT",
    "definition": "GST Appellate Tribunal - Second appellate authority hearing appeals against Commissioner (Appeals) orders",
    "technicalNote": "Constituted under Section 109 CGST Act. State Benches handle regional matters, Principal Bench in Delhi handles larger questions of law.",
    "relatedTerms": ["CESTAT", "First Appeal", "Tribunal", "Commissioner Appeals"],
    "category": "legal"
  },
  {
    "term": "CESTAT",
    "definition": "Customs, Excise and Service Tax Appellate Tribunal - Quasi-judicial body handling indirect tax disputes (pre-GST and continuing)",
    "technicalNote": "Established under Section 129 of Customs Act, 1962. Handles appeals for Customs, erstwhile Central Excise, and Service Tax matters. Regional benches across India.",
    "relatedTerms": ["GSTAT", "Tribunal", "Indirect Tax"],
    "category": "legal"
  },
  {
    "term": "Adjudication Authority",
    "definition": "Original authority (Proper Officer or Commissionerate) that issues the first order in GST disputes",
    "technicalNote": "Powers derived from Section 73-74 of GST Act. Issues Show Cause Notices (SCN) and adjudication orders determining tax liability.",
    "relatedTerms": ["Proper Officer", "SCN", "First Appeal"],
    "category": "legal"
  },
  {
    "term": "First Appeal",
    "definition": "Commissioner (Appeals) or Appellate Authority - First level of review against original adjudication orders",
    "technicalNote": "Hears appeals under Section 107 of GST Act. Must be filed within 3 months of the order date. State-level appellate authority.",
    "relatedTerms": ["Adjudication", "Commissioner Appeals", "Appellate Authority"],
    "category": "legal"
  },
  {
    "term": "Commissioner Appeals",
    "definition": "Commissioner (Appeals) - Officer designated to hear first appeals against adjudication orders",
    "technicalNote": "Appointed under GST Act to provide first tier of appellate review. Jurisdiction based on territorial assignment.",
    "relatedTerms": ["First Appeal", "Appellate Authority"],
    "category": "legal"
  },
  {
    "term": "Revisional Authority",
    "definition": "Authority under Section 108 GST Act empowered to revise orders prejudicial to revenue",
    "technicalNote": "Commissioner or specified officer can revise orders passed by subordinate authorities within specified time limits. Suo moto power.",
    "relatedTerms": ["AAAR", "Commissioner", "GST Act S.108"],
    "category": "legal"
  },
  {
    "term": "Principal Bench",
    "definition": "Head bench of an appellate tribunal, typically located at the national capital",
    "technicalNote": "Principal Bench of CESTAT/GSTAT in New Delhi handles matters of national importance and larger benches. Precedential value higher than regional benches.",
    "relatedTerms": ["GSTAT", "CESTAT", "Tribunal"],
    "category": "legal"
  },
  {
    "term": "SCN",
    "definition": "Show Cause Notice - Formal document issued by tax authorities requiring the taxpayer to explain why duty/tax should not be demanded",
    "technicalNote": "Issued under GST Act before adjudication. Taxpayer must reply within specified timeframe (typically 30 days, extendable).",
    "relatedTerms": ["Adjudication", "Proper Officer"],
    "category": "process"
  },
  {
    "term": "Proper Officer",
    "definition": "Officer empowered under GST law to perform specific functions like assessment, adjudication, or recovery",
    "technicalNote": "Defined under GST Act. Powers assigned based on monetary limits and territorial jurisdiction.",
    "relatedTerms": ["Adjudication Authority", "Commissionerate"],
    "category": "legal"
  },
  {
    "term": "Digital Filing",
    "definition": "Electronic submission of legal documents, petitions, and pleadings through online portals",
    "technicalNote": "GST authorities use ACES (Automation of Central Excise and Service Tax), CBIC Portal, or state-specific e-filing systems.",
    "relatedTerms": ["ACES", "E-Filing", "CBIC Portal"],
    "category": "technical"
  },
  {
    "term": "ACES",
    "definition": "Automation of Central Excise and Service Tax - Online portal for e-filing appeals and applications with CESTAT",
    "technicalNote": "Mandatory for most CESTAT filings. Provides case status tracking, online payment, and document submission.",
    "relatedTerms": ["CESTAT", "Digital Filing", "E-Filing"],
    "category": "technical"
  },
  {
    "term": "Jurisdiction",
    "definition": "Geographical or subject-matter area over which a legal authority has power to adjudicate",
    "technicalNote": "In GST, jurisdiction determined by registered office location (CGST/SGST) or transaction origin. Tribunal jurisdiction by bench location.",
    "relatedTerms": ["Authority Level", "Bench Location"],
    "category": "legal"
  },
  {
    "term": "Bench Location",
    "definition": "Physical location where a tribunal bench or appellate authority operates",
    "technicalNote": "CESTAT has benches in major cities (Delhi, Mumbai, Chennai, Kolkata, Ahmedabad, Bangalore, etc.). Cases assigned based on jurisdiction.",
    "relatedTerms": ["Jurisdiction", "CESTAT", "GSTAT"],
    "category": "process"
  },
  {
    "term": "Authority Level",
    "definition": "Hierarchical tier in the GST adjudication and appellate system",
    "technicalNote": "Ranges from Adjudication (original orders) through First Appeal, Tribunal, to High Court and Supreme Court. Each level has specific jurisdiction and powers.",
    "relatedTerms": ["Jurisdiction", "GST Hierarchy"],
    "category": "legal"
  },
  {
    "term": "Tribunal",
    "definition": "Quasi-judicial body with specialized expertise in specific areas of law like taxation, customs, or service tax",
    "technicalNote": "CESTAT and GSTAT are key tribunals for indirect tax matters. Decisions can be appealed to High Court on questions of law.",
    "relatedTerms": ["CESTAT", "GSTAT", "High Court"],
    "category": "legal"
  },
  {
    "term": "High Court",
    "definition": "Constitutional court at state level with original and appellate jurisdiction",
    "technicalNote": "Hears appeals from tribunals and lower courts. Issues writ petitions for constitutional matters. Decisions binding within state.",
    "relatedTerms": ["Supreme Court", "Tribunal", "Writ Petition"],
    "category": "legal"
  },
  {
    "term": "Supreme Court",
    "definition": "Apex court of India with final appellate jurisdiction on all matters",
    "technicalNote": "Hears appeals from High Courts on substantial questions of law. Decisions are binding across India as precedent.",
    "relatedTerms": ["High Court", "Precedent"],
    "category": "legal"
  }
]
